export const _id = (index: number) => `e99f09a7-dd88-49d5-b1c8-1daf80c2d7b${index}`;
/*
  { id: 'name', label: '종목명' },
  { id: 'price', label: '현재가' },
  { id: 'change', label: '등락' },
  { id: 'buy', label: '매입가', align: 'center' },
  { id: 'amount', label: '수량' },
  { id: 'profit', label: '손익' },
  { id: 'percent', label: '수익률' },
*/
export const _name = (index: number) =>
  [
    'TIGER 엔비디아미국채커버드콜밸런스(합성)',
    'TIGER 엔비디아미국채커버드콜밸런스(합성)',
    'TIGER 엔비디아미국채커버드콜밸런스(합성)',
    'TIGER 엔비디아미국채커버드콜밸런스(합성)',
    'TIGER 엔비디아미국채커버드콜밸런스(합성)',
    'TIGER 엔비디아미국채커버드콜밸런스(합성)',
    'TIGER 엔비디아미국채커버드콜밸런스(합성)',
    'TIGER 엔비디아미국채커버드콜밸런스(합성)',
    'TIGER 엔비디아미국채커버드콜밸런스(합성)',
    'TIGER 엔비디아미국채커버드콜밸런스(합성)',
  ][index];

export const _price = (index: number) =>
  [
    35.17, 57.22, 64.78, 50.79, 9.57, 61.46, 96.73, 63.04, 33.18, 36.3, 54.42, 20.52, 62.82, 19.96,
    25.93, 70.39, 23.11, 67.23, 14.31, 31.5, 26.72, 44.8, 37.87, 75.53,
  ][index];

export const _change = (index: number) =>
  [
    35.17, 57.22, 64.78, 50.79, 9.57, 61.46, 96.73, 63.04, 33.18, 36.3, 54.42, 20.52, 62.82, 19.96,
    25.93, 70.39, 23.11, 67.23, 14.31, 31.5, 26.72, 44.8, 37.87, 75.53,
  ][index];

export const _buy = (index: number) =>
  [
    35.17, 57.22, 64.78, 50.79, 9.57, 61.46, 96.73, 63.04, 33.18, 36.3, 54.42, 20.52, 62.82, 19.96,
    25.93, 70.39, 23.11, 67.23, 14.31, 31.5, 26.72, 44.8, 37.87, 75.53,
  ][index];

export const _amount = (index: number) =>
  [
    35.17, 57.22, 64.78, 50.79, 9.57, 61.46, 96.73, 63.04, 33.18, 36.3, 54.42, 20.52, 62.82, 19.96,
    25.93, 70.39, 23.11, 67.23, 14.31, 31.5, 26.72, 44.8, 37.87, 75.53,
  ][index];

export const _profit = (index: number) =>
  [
    35.17, 57.22, 64.78, 50.79, 9.57, 61.46, 96.73, 63.04, 33.18, 36.3, 54.42, 20.52, 62.82, 19.96,
    25.93, 70.39, 23.11, 67.23, 14.31, 31.5, 26.72, 44.8, 37.87, 75.53,
  ][index];

export const _percent = (index: number) =>
  [
    35.17, 57.22, 64.78, 50.79, 9.57, 61.46, 96.73, 63.04, 33.18, 36.3, 54.42, 20.52, 62.82, 19.96,
    25.93, 70.39, 23.11, 67.23, 14.31, 31.5, 26.72, 44.8, 37.87, 75.53,
  ][index];
